'number' + 3 + 3 /* В результаті буде 'number33', 
спершу виконається операція приведення числа 3 до строки, 
буде 'number3', потім виконається наступна ітерація теж приведення числа 3 до строки.
 Конкатенація зліва на право. */


null + 3 /* В результаті буде 3 . Спочатку значення null приводиться до числа 0, потім
виконується арифметична операція 0+3 */

5 && "qwerty" /*В результаті буде 'qwerty'. Якщо привести перше і друге значення до 
булевого , то обидва будуть true . Тому результат повертає останнє істине значення*/

+'40' + +'2' + "hillel"; /* В результаті '42hillel'. Бо унарний плюс приводить строку до
числа тому виконується опервція 40 + 2 = 42 . Потім конкатенується з строкою перетворюючись
на строку в результаті  */

'10' - 5 === 6; /* В результаті false. Виконується арифметична опервція 10-5, так як 
строка '10' є валідним для преведення в число . Тому 10 - 5 = 5 . === це оператор 
строгої нерівності тому 5 не дорівнює 6 */

true + false /* Дорівнює 1 , бо згідно преведення true = 1 , a false = 0 , тому 1 + 0 */

'4px' - 3 /* В результаті приведення строки до числа , бо далі стоїть оператор мінуса 
буде NaN. начення Nan не дорівнює нічому, включаючи себе. Будь які операції з Nan 
повертають Nan*/

'4' - 3 /* В результаті число 1 приведення строки до числа 4 , бо далі стоїть оператор 
мінуса буде арифметичний вираз 4 - 3 = 1*/

'6' + 3 ** 0; /* В результаті строка '61'. У оператора ступення є свій прирітет тому він
виконується першим , тому 3**0 = 1 , потім конкатенуємо до строки '61' + 1 */

12 / '6' /* В результаті число 2 , Строка приводиться до числа , бо стоїть знак поділу .
Тому виконується арифметичний вираз 12 / 6 = 2 */

'10' + (5 === 6); /* В результаті строка '10false', перша операція іиконується в дужках
=== знак строгої рівності. В результаті повертає булеве значення false . Далі виконується
'10' + false , що привожиться до строки */

null == '' /* В результаті false, першою операцією приводимо null до строки і буде значення
'null' , що не дорівнює значенню '' */

3 ** (9 / 3); /* В результаті число 27. Спочатку виконується дія в дужках потім возведення
в ступінь 3 ** 3 = 27 */

!!'false' == !!'true' /*В результаті true . Приводимо строки в булеве значення, 
буде true == true, бо непуста строка це true , а !true =  false , якщо знов виконати !false = true
 ! - оператор not */

0 || '0' && 1 /*В результаті 1 . В першій частині умови оператор or (0 - хибне, тому поверне "0"),
так як це істине значення , то оператор and поверне останнє значення.*/

(+null == false) < 1; /*В результаті false. Перша ітерація унарний + призводить значення до числа
тобто null = 0 , далі вираз 0 == false , приводимо числове значення до булевого , в результаті
true < 1 , тобто 1 < 1 */

false && true || true /*В результаті true. В першій частині умови оператор and повертає false 
перше хибне значення, в другій частині оператор or  повертає останнє значення , бо є хибне */

false && (false || true); /*В результаті false.  В дужках оператор or повернув останнє значення
true , потім виконуємо  false && true , оператор and повертає false 
перше хибне значення*/

(+null == false) < 1 ** 5; /*В результаті false. Перша ітерація унарний + призводить значення до числа
тобто null = 0 , далі вираз 0 == false , приводимо числове значення до булевого в результаті
true , потім виконуємо частину 1 ** 5 = 1 ,rue < 1 , тобто 1 < 1  */
